---
type: DistributionSysType
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 7
tags: [revit-api, class]
---

# DistributionSysType

`Autodesk.Revit.DB.Electrical.DistributionSysType` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | ElectricalPhase | — | `public ElectricalPhase ElectricalPhase { get ; set ; }` |
| Property | ElectricalPhaseConfiguration | — | `public ElectricalPhaseConfiguration ElectricalPhaseConfiguration { get ; set ; }` |
| Property | IsInUse | — | `public bool IsInUse { get ; }` |
| Property | NumWires | — | `public int NumWires { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | VoltageLineToGround | — | `public VoltageType VoltageLineToGround { get ; set ; }` |
| Property | VoltageLineToLine | — | `public VoltageType VoltageLineToLine { get ; set ; }` |